both_supersonicCDCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0  0         0) //0
    (0  0.892062 -0.038911) //1
    (0  0.892062  0.038911) //2
    (10 0         0) //3
    (10 0.690988 -0.030140) //4 0.690988
    (10 0.690988  0.030140) //5

   
);

blocks
(
    hex (1 2 0 0 4 5 3 3) (1 12 130) simpleGrading (1 1 1)
    
);

edges
(
        polyLine 1 4
        (
                (0      0.892062        -0.038911)
                (0.5	0.885489        -0.038624)
                (1	0.866130        -0.037780)
                (1.5	0.835084        -0.036426)
                (2	0.794238        -0.034644)
                (2.5	0.746353        -0.032555)
                (3	0.695176        -0.028158)
                (3.5	0.645538        -0.028158)
                (4	0.603244        -0.026313)
                (4.5	0.574451        -0.025057)
                (5	0.564190        -0.024610)
                (5.5	0.567631        -0.024760)
                (6	0.577501        -0.025190)
                (6.5	0.592548        -0.025847)
                (7      0.610980        -0.026651)
                (7.5	0.630783        -0.027514)
                (8	0.649983        -0.028352)
                (8.5	0.666830        -0.029087)
                (9	0.679902        -0.029657)
                (9.5	0.688164        -0.030017)
                (10     0.690988        -0.030140)
        )

        polyLine 2 5
        (
                (0      0.892062        0.038911)
                (0.5	0.885489        0.038624)
                (1	0.866130        0.037780)
                (1.5	0.835084        0.036426)
                (2	0.794238        0.034644)
                (2.5	0.746353        0.032555)
                (3	0.695176        0.028158)
                (3.5	0.645538        0.028158)
                (4	0.603244        0.026313)
                (4.5	0.574451        0.025057)
                (5	0.564190        0.024610)
                (5.5	0.567631        0.024760)
                (6	0.577501        0.025190)
                (6.5	0.592548        0.025847)
                (7      0.610980        0.026651)
                (7.5	0.630783        0.027514)
                (8	0.649983        0.028352)
                (8.5	0.666830        0.029087)
                (9	0.679902        0.029657)
                (9.5	0.688164        0.030017)
                (10     0.690988        0.030140)
        )
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (1 0 0 2)
            
        );
    }
    axis
    {
        type empty;
        faces
        (
            (0 0 3 3)
            
        );
    }



    outlet
    {
        type patch;
        faces
        (
            (4 5 3 3)
        );
    }
    asym2
    {
        type wedge;
        faces
        (
            (1 4 3 0)
           
        );
    }
    nozzle
    {
        type wall;
        faces
        (
            (1 2 5 4)
	 );
    }
   asym1
    {
        type wedge;
        faces
        (
            (0 3 5 2)
        );
    }
);
mergePatchPairs
(
);


// ************************************************************************* //
