both_supersonicCDCase/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    axis
    {
        type            empty;
    }
    outlet
    {
        type            zeroGradient;
    }
    asym2
    {
        type            wedge;
    }
    nozzle
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    asym1
    {
        type            wedge;
    }
}


// ************************************************************************* //
