both_supersonicCDCase/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
1560
(
10000
10000
10000
10000
10000
10000
10000
10000
...
)
;

boundaryField
{
    inlet
    {
        type            totalPressure;
        rho             none;
        psi             thermo:psi;
        gamma           1.4;
        p0              uniform 10000;
        value           uniform 10000;
    }
    axis
    {
        type            empty;
    }
    outlet
    {
        type            zeroGradient;
    }
    asym2
    {
        type            wedge;
    }
    nozzle
    {
        type            zeroGradient;
    }
    asym1
    {
        type            wedge;
    }
}


// ************************************************************************* //
