both_supersonicCDCase/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 100;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 298;
    }
    axis
    {
        type            empty;
    }
    outlet
    {
        type            zeroGradient;
    }
    asym2
    {
        type            wedge;
    }
    nozzle
    {
         type        externalWallHeatFluxTemperature;
        mode            flux;
         q            5000;//555but/s=.086but/s.in
       // Ta              constant 295.15;
       // h               uniform 10.0;
        thicknessLayers ();
        kappaLayers     ();
        kappaMethod     fluidThermo;
        value           $internalField;
    }
    asym1
    {
        type            wedge;
    }
}


// ************************************************************************* //
