both_supersonicCDCase/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 2.3039e-5;

boundaryField
{
    nozzle
    {
        type           compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
    inlet
    {
           type            calculated;
        value           $internalField;
    }
    outlet
    {
           type            zeroGradient;
       
    }
  axis
     {
         type           empty;  
      }
   asym1
    {
        type            wedge;
    }
    asym2
    {
        type            wedge;
    }
}


// ************************************************************************* //
