both_supersonicCDCase/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 5e-5;

boundaryField
{
    nozzle
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    inlet
    {
         type           fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    axis
     {
        type            empty;
      }
   asym1
    {
        type            wedge;
    }
    asym2
    {
        type            wedge;
    }
}


// ************************************************************************* //
