both_supersonicCDCase/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    nozzle
    {
        type            nutkRoughWallFunction;
        Ks              uniform 0.03832;
        Cs              uniform 0.5;
        value           $internalField;
    }
    inlet
    {
        type            fixedValue;
        value          $internalField;
    }
    outlet
    {
        type            zeroGradient;
        
    }
    axis
     {
         
        type           empty;
      }
 asym1
    {
        type            wedge;
    }
    asym2
    {
        type            wedge;
    }
}


// ************************************************************************* //
